#Использовать packageinfo

Перем _ИнформацияОПакете; // ИнформацияОПакете (см. packageinfo)

#Область ОбработчикиСобытий

// Создает описание консольного приложения.
&Желудь("ОписаниеКонсольногоПриложения")
&Верховный
Процедура ПриСозданииОбъекта()

	ПолноеИмяФайла = ОбъединитьПути(ТекущийСценарий().Каталог, "../../..", "packagedef");
	_ИнформацияОПакете = Новый ИнформацияОПакете(ПолноеИмяФайла);

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает имя консольного приложения.
//
// Возвращаемое значение:
//   Строка - Имя приложения.
Функция ИмяПриложения() Экспорт

    Возврат _ИнформацияОПакете.Имя();

КонецФункции

// Возвращает описание консольного приложения.
//
// Возвращаемое значение:
//   Строка - Описание приложения.
Функция ПолноеИмяПриложения() Экспорт

    Возврат _ИнформацияОПакете.Описание();

КонецФункции

// Возвращает версию консольного приложения.
//
// Возвращаемое значение:
//   Строка - Версия приложения.
Функция ВерсияПриложения() Экспорт

    Возврат _ИнформацияОПакете.Версия();

КонецФункции

#КонецОбласти
