// Входные параметры и служебные значения GitHub Action.
&Деталька(Значение = "DEPOS.TARGET", ЗначениеПоУмолчанию = "")
Перем Цель Экспорт;

&Деталька(Значение = "DEPOS.PACKAGEDEF", ЗначениеПоУмолчанию = "")
Перем Манифест Экспорт;

&Деталька(Значение = "DEPOS.FILTER", ЗначениеПоУмолчанию = "")
Перем Фильтр Экспорт;

&Деталька(Значение = "DEPOS.ENGINE", ЗначениеПоУмолчанию = "")
Перем Движок Экспорт;

&Деталька(Значение = "DEPOS.VERSION", ЗначениеПоУмолчанию = "")
Перем ВерсияDepos Экспорт;

&Деталька(Значение = "DEPOS.OPM.MIN.VERSION", ЗначениеПоУмолчанию = "")
Перем МинимальнаяВерсияOPM Экспорт;

&Деталька(Значение = "DEPOS.REPORT.PATH", ЗначениеПоУмолчанию = "")
Перем ПутьОтчета Экспорт;

&Деталька(Значение = "DEPOS.MESSAGE.PREFIX", ЗначениеПоУмолчанию = "")
Перем ПрефиксСообщения Экспорт;

&Деталька(Значение = "DEPOS.BASE", ЗначениеПоУмолчанию = "")
Перем База Экспорт;

&Деталька(Значение = "DEPOS.DEFAULT.BRANCH", ЗначениеПоУмолчанию = "")
Перем ВеткаРепозиторияПоУмолчанию Экспорт;

&Деталька(Значение = "DEPOS.TRIGGER.REF.NAME", ЗначениеПоУмолчанию = "")
Перем ИмяСсылкиСобытия Экспорт;

&Деталька(Значение = "DEPOS.BRANCH", ЗначениеПоУмолчанию = "")
Перем Ветка Экспорт;

&Деталька(Значение = "RUNNER.TEMP", ЗначениеПоУмолчанию = "")
Перем ВременныйКаталог Экспорт;

&Деталька(Значение = "GITHUB.ENV", ЗначениеПоУмолчанию = "")
Перем ПутьОкруженияGitHub Экспорт;

&Деталька(Значение = "GITHUB.OUTPUT", ЗначениеПоУмолчанию = "")
Перем ПутьВыводаGitHub Экспорт;

&Деталька(Значение = "GH.TOKEN", ЗначениеПоУмолчанию = "")
Перем ТокенGitHub Экспорт;

&Деталька(Значение = "GH.REPO", ЗначениеПоУмолчанию = "")
Перем РепозиторийGitHub Экспорт;

#Область ОбработчикиСобытий

// Создает набор параметров, внедряемых из переменных среды.
&Желудь
Процедура ПриСозданииОбъекта()

КонецПроцедуры

#КонецОбласти
