#Область ОбработчикиСобытий

// Создает объект для записи переменных в GITHUB_ENV.
&Желудь
Процедура ПриСозданииОбъекта()

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Добавляет переменные в файл окружения GitHub Actions.
//
// Параметры:
//   Путь - Строка - Путь к GITHUB_ENV.
//   Значения - Структура - Имена и значения переменных.
//
// Исключения:
//   Ошибка записи файла - Если GITHUB_ENV недоступен для записи.
Процедура Записать(Путь, Значения) Экспорт

    Запись = Новый ЗаписьТекста(Путь, "UTF-8", Символы.ПС, Истина, Символы.ПС);

    Для Каждого Переменная Из Значения Цикл
        Запись.ЗаписатьСтроку(Переменная.Ключ + "=" + Переменная.Значение);
    КонецЦикла;

    Запись.Закрыть();

КонецПроцедуры

#КонецОбласти
