#Использовать "../src/pr"
#Использовать "../src/cli"
#Использовать asserts

#Область Тесты

&Тест
Процедура ТестДолжен_ПередатьАргументыБезИзменений() Экспорт

    // Подготовка
    Значения = Новый Массив;
    Значения.Добавить("a b");
    Значения.Добавить("c""d");
    Значения.Добавить("e\f");
    Значения.Добавить("e\");
    Значения.Добавить("e\""f");
    Значения.Добавить("a'b");
    Значения.Добавить("/^autumn-.*$/");
    Исполнитель = Новый ИсполнительВнешнихКоманд;

    Для Каждого Значение Из Значения Цикл
        Аргументы = Новый Массив;
        Аргументы.Добавить("-c");
        Аргументы.Добавить("Сообщить(АргументыКоманднойСтроки[0]);");
        Аргументы.Добавить(Значение);

        // Действие
        Результат = Исполнитель.ИсполнитьКоманду("oscript", Аргументы);

        // Проверка
        Утверждения.ПроверитьРавенство(0, Результат.КодВозврата, Результат.Вывод);
        Утверждения.ПроверитьРавенство(Значение, СокрЛП(Результат.Вывод));
    КонецЦикла;

КонецПроцедуры

#КонецОбласти
