Перем _Ответы;
Перем _ПоследниеЗаголовки;
Перем _КоличествоЗапросов;

#Область ОбработчикиСобытий

Процедура ПриСозданииОбъекта()

    _Ответы = Новый Соответствие;
    _КоличествоЗапросов = Новый Соответствие;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ДобавитьОтвет(Ресурс, Код, Тело) Экспорт

    _Ответы.Вставить(Ресурс, Новый Структура("Код,Тело", Код, Тело));

КонецПроцедуры

Функция Получить(Ресурс, Заголовки) Экспорт

    _ПоследниеЗаголовки = Заголовки;

    Количество = _КоличествоЗапросов.Получить(Ресурс);
    Если Количество = Неопределено Тогда
        Количество = 0;
    КонецЕсли;

    _КоличествоЗапросов.Вставить(Ресурс, Количество + 1);

    Ответ = _Ответы.Получить(Ресурс);
    Если Ответ = Неопределено Тогда
        Возврат Новый Структура("Код,Тело", 404, "{}");
    КонецЕсли;

    Возврат Ответ;

КонецФункции

Функция КоличествоЗапросов(Ресурс) Экспорт

    Количество = _КоличествоЗапросов.Получить(Ресурс);
    Возврат ?(Количество = Неопределено, 0, Количество);

КонецФункции

Функция ПоследнийЗаголовок(Имя) Экспорт

    Возврат _ПоследниеЗаголовки.Получить(Имя);

КонецФункции

#КонецОбласти
