Перем _Ответы;
Перем _ПоследниеЗаголовки;

#Область ОбработчикиСобытий

Процедура ПриСозданииОбъекта()

    _Ответы = Новый Соответствие;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ДобавитьОтвет(Ресурс, Код, Тело) Экспорт

    _Ответы.Вставить(Ресурс, Новый Структура("Код,Тело", Код, Тело));

КонецПроцедуры

Функция Получить(Ресурс, Заголовки) Экспорт

    _ПоследниеЗаголовки = Заголовки;
    Ответ = _Ответы.Получить(Ресурс);
    Если Ответ = Неопределено Тогда
        Возврат Новый Структура("Код,Тело", 404, "{}");
    КонецЕсли;

    Возврат Ответ;

КонецФункции

Функция ПоследнийЗаголовок(Имя) Экспорт

    Возврат _ПоследниеЗаголовки.Получить(Имя);

КонецФункции

#КонецОбласти
